text = {
	"usual":"Чекаю на оцінку наступних закладів",
	"help":"У разі будь яких проблем, питань, або пропозицій пишіть @vognehelp_bot",
	"start_0":"Привіт, *",
	"start_1":"!*\nЯ бот Vogneborets і я допоможу зрозуміти, наскільки заклади захищені від вогню 😎",
	"description":"Я допомагаю:\n\n• оцінити пожежну безпеку закладу\n• дізнатись статистику безпечності закладів\n• зв’язатись власниками закладів та надіслати оновлену інформацію про пожежну безпеку\n• дізнатись корисні поради про пожежну безпеку",
	"check":"Перевірити заклад ✔️",
	"stat":"Статистика 📊",
	"advise":"Що треба знати❓",
	"place":"Я – власник закладу 🏠",
	"place_ok":"<b>У закладі вже покращено пожежну безпеку?</b>\nНапиши нам про це у бот @vognehelp_bot, та надішли фотографії з закладу. Ми залюбки змінимо оцінку і додамо коментар про позитивні зміни в закладі!",
	"check_info_1":"Ти – не пожежний інспектор, але твоя небайдужість допоможе власнику закладу зробити заклад безпечнішим.",
	"check_info_2":"Ти побачиш прості питання з відповідями так або ні. Вони потребують уваги, а деякі здаватимуться дивними. \nНу як, почнемо?",
	"go_check":"Почнемо 🔛",
	"back":"Головне меню 🔙",
	"safe":"Прості пункти, що врятують ваше життя \n Українською: \n http://bit.ly/vogneborets-ua \n Російською: \n http://bit.ly/vogneborets-ru",
	"send_loc":"Для початку обери заклад.\nДля цього необхідно увімкнути геолокацію 📡📲 і натиснути кнопку \n\"Надіслати геолокацію⛳️\"",
	"loc":"Надіслати геолокацію ⛳️",
	"clarification":"Який саме заклад хочеш перевірити?",
	"no_adress":"Немає відповідного  🤔",
	"loc_none":"*Твоє місце не відображається?*\nНатисни на 📎 і прикріпи геолокацію власноруч точно навівши маркер📍 на потрібне місце",
	"test_start":"Опитування займе близько 10 хвилин та потребує вашої уважності. \nЯкщо сумніваєшся, тисни кнопку “Підсказка 👌🏻”.",
	"no_review":"Це місце ще ніхто не оцінював",
	"yes":"Так ✅",
	"no":"Ні ❌",
	"dk":"Не знаю ❓",
	"info":"Підсказка 👌🏻",
	"comment":"Хочеш ще щось дописати?",
	"cancel_comment":"Не бажаю комментувати!",
	"users":"Інші користувачі також оцінили це місце\nСередня оцінка ",
	"users_stat":"Середня оцінка ",
	"link":"Більше ви можете знайти на сайті:\nvogneborets.com",
	"com":"Недавні комментарі:\n",
	"submit":"Дякуємо, завдяки тобі заклади можуть стати безпечнішими!\nСередня оцінка безпеки закладу: *",
	"submit_end":"*\n\nПереглянути оцінки всіх закладів можна на сайті vogneborets.com.\n\nЯкщо ти – власник закладу, натисни /place"}

question = {
    1:"Чи бачиш вихід або знак виходу?",
    2:"Чи бачиш план евакуації?",
    3:"Чи бачиш засіб пожежогасіння або знак, де вони знаходяться?",
    4:"Чи бачиш пожежну сигналізацію?",
    5:"На евакуаційному виході є замок?",
    6:"У коридорах стоять меблі чи ремонтні інструменти?",
    7:"Чи є нерозкривні ґрати (решітки) на вікнах?",
    8:"Стіни приміщення оздоблені вагонкою або на підлозі є килими?",
    9:"Чи бачиш незахищені електропроводи або світильники без плафонів?",
    10:"Чи бачиш легкозаймисті речовини (фарбу, лак, розчинник)?",
    11:"Чи є під’їзди до будівлі для пожежної машини (круговий об’їзд навколо будівлі та в’їзд на території з двох сторін)?",
    12:"Чи є на будівлі знак місце знаходження пожежного гідранта для забору води пожежною машиною?",
    13:"Чи проводяться раз в пів року практичні тренування на випадок пожежі?",
    14:"Чи є мінімум два виходи з будівлі з різних сторін?",
    15:"Чи є план евакуації в номері, блоці чи кімнаті?",
    16:"Чи є у номері правила пожежної безпеки?"}


info = {
    1:"Вихід або ось такий знак (чи схожий) мають бути видні з будь-якої точки приміщення.",
    2:"План евакуації – це не просто папірець в рамці. Він має бути:\n✅ формату А3;\n✅ зорієнтований, тобто ліворуч на плані має відповідати ліворуч в реальності;\n✅ відмічені виходи та евакуаційні шляхи, вогнегасники, пожежні щити та крани, а також ваше місце знаходження.\nЯкщо будь-чого з переліченого немає – та навіщо такий план тоді потрібен?!",
    3:"Засіб пожежогасіння – це:\n✅ вогнегасник (вуглекислотний ВВК-2, ВВК-3.5).\n✅ пожежний кран: кран з вентилем, рукав (шланг), ствол (насадка на рукав) – все це має бути з’єднане між собою, а також може бути вогнегасник.\n✅ пожежний щит: вогнегасник, кошма (вогнетривка тканина), бак з піском, лопата та відра, сокири пожежні (щоб можна було виламати двері чи вікна), багор (гак) та лом.",
    4:"Ось так вони зазвичай виглядають кріпляться на стелі.\nНа жаль, справність цієї системи ти перевірити не зможеш, але її наявність вселяє надію.\nУ нових будівлях встановлюють електронне табло “вихід” – воно, окрім того, що світиться, ще пищить під час евакуації. \nЦе допомагає людям орієнтуватися куди бігти під час паніки.",
    5:"Це зазвичай двері та виходи на дах, де висить замок та напис “Ключ у вахтера на 1 поверсі”. Усі евакуаційні виходи мають бути відчинені, інакше вони втрачають сенс!\nАле з іншої сторони це небезпечно – можуть пограбувати. Який вихід із ситуації? \nВихід – спеціальні пристрої, які відчиняються зсередини вільно і без ключа, але водночас зачинені для доступу ззовні.",
    6:"Коридори та інші проходи мають бути вільними – ніякі предмети на кшталт меблі, ремонтні інструменти та інші предмети НЕ мають звужувати прохід. Під час евакуації це може призвести до тисняви людей. Проходять ремонтні роботи – перекривається шлях для відвідувачів.",
    7:"Ми всі боїмось пограбувань, тому ставимо ґрати (решітки). Проте вдень, коли проходить навчання, заходи чи просто робочі процеси, вони мають бути відчинені. Глухих (нерозкривних) ґрат немає бути!",
    8:"Вагонка та килими – це не лише пережиток минулого, а реально небезпека при пожежі:\n❌ вагонка ❌\nДопомагає вогню з одного приміщення швидко розповсюдитись по всьому закладу.\n❌ килими ❌\nШвидко загоряються та виділяють багато диму, а під час евакуації за них можна зачепитись та впасти.\n\nЗа законом стіни приміщення можуть бути оздоблені дерев’яною вагонкою, а на підлозі може бути килим при умові, що їх обробляють спеціальним вогнестійким розчином. Проте це дуже дорого (близько 300 грн 1 кв.м), тому якщо ви бачите вагонку чи килими – вони скоріш за все необроблені.",
    9:"Ми сподіваємось, що такого ніде немає, але все одно напишемо:\n✅ всі проводи мають бути захищені коробами, \n✅ дози мають бути закритими,\n✅ світильники мають бути з плафонами або іншими елементами, які не дають можливість лампочці випасти з конструкції.",
    10:"Ми б це не писали, але у житті таке буває: роблять ремонт приміщення, пофарбували підлогу та лишили банку з фарбою (може щось підмалювати треба буде?). НІТ! Фарби, лаки та розчинники не мають залишатися у коридорах чи проходах, а мають зберігатись в окремому приміщенні.",
    11:"Пожежники насправді дуже добрі люди. Адже за законом якщо вони потрощать неправильно припарковане авто, щоб доїхати до місця пожежі, жодної компенсації вони не нестимуть. Ми знаємо, що паркування – це вічна проблема, особливо в центрі міста, проте подумайте про це, через призму пожеж. А також до навчальних закладів мають бути в’їзди з двох сторін та круговий об’їзд.",
    12:"Ви теж думаєте, що пожежники возять воду з собою і її достатньо, щоб загасити будь-яку пожежу? А от і НІТ! Звичайного пожежного автомобіля вистачає на 5 з гаком хвилин подачі води для гасіння пожежі. А далі – забір води із джерел протипожежного водопостачання. На громадських закладах, де перебуває понад 50 людей мають бути знаки, які вказують, де знаходиться пожежний гідрант – ось так вони виглядають.",
    13:"Для всіх дітей у дитячих садочках, учнів у школах та студентах мають проводитись теоретичні та практичні заняття про дії на випадок пожежі не рідше, ніж раз на пів року. Розказали, що робити і як та чим користуватись, а через кілька днів всіх на тренувальну евакуацію. Краще так, ніж потім імпровізувати.",
    14:"У навчальних закладах, супермаркетах, конференц-залах, кінотеатрах – скрізь, де багато збирається людей, має бути мінімум 2 евакуаційні виходи.",
    15:"Залишаєтесь у готелі, хостелі чи проживаєте у гуртожитку? В кожній номері/ кімнаті/ блоці мають бути такі плани евакуації – не ігноруйте їх!",
    16:"Знаємо, ми всі читаємо правила та інструкції, коли щось трапилось. Але в номері/ кімнаті/ блоці мають бути правила пожежної безпеки – не ігноруйте їх!"}


all_types = {
	1:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], # 1-14
	2:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], #1-10
	3:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], #1-10
	4:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14], #1-10 + 14
	5:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 15, 16], #1-10 + 14,15.16
	6:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]} #1-10 + 11

right_answers = [1,1,1,1,0,0,0,0,0,0,1,1,1,1,1,1]

images = {
	1:"images/1.png",
	3:"images/3.png",
	4:"images/4.png",
	8:"images/8.png",
	12:"images/12.png"
}

if __name__ == "__main__":
	print(len(right_answers))