sticker_twinkly = "CAADAgAD_iAAAulVBRgi4A0qOPfBBRYE"

text = {
	"usual":"Чекаю на оцінку наступних закладів",
	"start_0":"Раді вас бачити, *",
	"start_1":"*\nМи створили бот, який допоможе оцінити пожежну безпеку закладу, в якому ви знаходитесь.\nА також переглянути оцінки та коментарі інших людей.",
	"advise":"Що треба знати?",
	"check":"Перевірити заклад",
	"safe":"Посилання на ресурс",
	"send_loc": "Надішліть місце розташування, щоб оцінити безпеку закладу.\nДля цього необхідно увімкнути геолокацію 📍📲 \nі натиснути кнопку \"Перевірити заклад\"",
	"clarification":"Яке саме місце ви хочете вибрати?",
	"state":"Ви можете дати місцю оцінку або дізнатися що про нього думаються інші",
	"mark":"Оцінити",
	"stat":"Статистика",
	"no_adress":"Немає відповідного  🤷‍♂️",
	"loc_none":"*Ваше місце не відображається?*\nНатисність на 📎 і прікріпить геолокацію власноруч навівши маркер📍 на місце",
	"loc_get":"Опитування займе близько 10 хвилин та потребує вашої уважності. Від вас залежить безпека цього закладу!",
	"loc_answer":"Ось все, що у мене є про це місце:",
	"no_review":"Це місце ще ніхто не оцінював",
	"yes":"Так ✅",
	"no":"Ні ❌",
	"dk":"Не знаю ❔",
	"info":"Інфо❕",
	"comment":"Залиште комментар про це місце",
	"users":"Інші користувачі також оцінили це місце\nСередня оцінка ",
	"users_stat":"Середня оцінка ",
	"com":"Недавні комментарі:\n",
	"submit":"Дякуємо, ви робите заклади безпечнішими! \n\nВаші відповіді будуть включені до статистики та відображатимуться на мапі.\n http://54.188.111.131 \nА також ми надішлемо їх до ДСНС в Одеській області.\nРейтинг безпеки: "}

question = {
	1:"Чи бачите вихід або знак виходу з будь-якої точки приміщення?",
	2:"Чи бачите план евакуації?",
	3:"Чи бачите засіб пожежогасіння або знак, де вони знаходяться, з будь-якої точки приміщення?",
	4:"Чи бачите елементи пожежної сигналізації?",
	5:"Чи бачите замки на евакуаційних дверях чи наглухо забиті двері?",
	6:"Чи бачите в проходах захаращення меблями, ремонтними чи іншими предметами?",
	7:"Чи є нерозкривні або закриті грати (решітки) на вікнах?",
	8:"Чи є в проходах оздоблення стін з горючих матеріалів та килими на підлозі?",
	9:"Чи бачите ви незахищені електропроводи або світильники без плафонів?",
	10:"Чи бачите легкозаймисті речовини (фарбу, лак, розчинник)?",
	11:"Чи є під’їзди до будівлі для пожежної машини?",
	12:"Чи є на будівлі знак місцезнаходження пожежного гідранту для забору води пожежною машиною?",
	13:"Чи проводяться раз в півроку практичні тренування на випадок пожежі?",
	14:"Чи є мінімум два виходи з будівлі з різних сторін?",
	15:"Чи є план евакуації в номері, блоці чи кімнаті?",
	16:"Чи є інструкція у номері про правила пожежної безпеки?"}

info = {
	1:"Знак на зеленому фоні, ідеально – електронна вивіска з підсвіткою.",
	2:"План евакуації має бути:\n- формату А3;\n– зорієнтований, тобто ліворуч на плані має відповідати ліворуч в реальності;\n– відмічені виходи та евакуаційні шляхи, вогнегасники, пожежні щити та крани, а також ваше місцезнаходження.",
	3:"Засоби пожежогасіння – це (один з перелічених):\n* вогнегасник (вуглекислотний ВВК-2, ВВК-3.5).\n* пожежний кран: кран з вентилем, рукав (шланг), ствол (насадка на рукав) – все це має бути з’єднане між собою, а також може бути вогнегасник.\n* пожежний щит: вогнегасник, кошма (вогнетравка тканина), бак з піском, лопата та відра, сокири пожежні (щоб можна було виламати двері чи вікна), багор (гак) та лом.",
	4:"Ось такі елементи на стелі.\nДатчики уловлюють дим, а через динаміки оголошується пожежна тривога. Звичайно, справність цієї системи ви не перевірите, але її наявність вселяє надію.",
	5:"Запасні виходи мають бути відкриті та легкодоступні",
	6:"Коридори мають бути вільними – ніякі предмети як меблі чи ремонтні інструменти НЕ мають звужувати прохід. Проходять ремонтні роботи – перекривається шлях для відвідувачів.",
	7:"Ми всі боїмось пограбувань, тому ставимо грати. Проте вдень, коли проходить навчання, заходи чи просто робочі процеси, грати мають бути відчинені. Глухих (нерозкривних) грат немає бути!",
	8:"Стіни НЕ мають бути оббиті пластиковою чи дерев’яною вагонкою. Це небезпечно, бо вогонь з одного приміщення легко розповсюджується по всьому приміщенню, а також – проводка, яка проходить під вагонкою, може коротнути та загоряться стіни. Килим на підлозі небезпечний, бо легко займається та виділяє багато диму, а при евакуації за нього можна зачепитись та впасти.",
	9:"Всі проводи мають бути захищені коробами, гофрою, дози мають бути закритими, а світильники мають бути з плафонами або іншими елементами, які не дають можливість лампочці випасти з конструкції.",
	10:"Проходить ремонт та лишили банку з фарбою – може щось підмалювати треба буде?. НІ! Фарби, лаки та розчинники не мають залишатися у коридорах чи проходах, а мають зберігатись в окремому приміщенні.",
	11:"Круговий об’їзд навколо будівлі та в’їзд на території з двох сторін",
	12:"Звичайного пожежного автомобіля вистачає на 5 з гаком хвилин подачі води для гасіння пожежі. На громадських закладах, де перебуває понад 50 людей, мають бути знаки, які вказують, де знаходиться пожежний гідрант.",
	13:"Для дітей, учнів та студентів мають проводиться теоретичні заняття та тренувальну евакуацію не рідше, ніж раз на пів року.",
	14:"У навчальних закладах, супермаркетах, конференц-залах, кінотеатрах – скрізь, де багато збирається людей, має бути мінімум 2 евакуаційні виходи.",
	15:"План евакуації має бути:\n- формату А3;\n– зорієнтований, тобто ліворуч на плані має відповідати ліворуч в реальності;\n– відмічені виходи та евакуаційні шляхи, вогнегасники, пожежні щити та крани, а також ваше місцезнаходження.",
	16:"Заборони паління, вказівки де знаходиться пожежне обладння та номер пожежників"}

all_types = {
	1:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], # 1-14
	2:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], #1-10
	3:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], #1-10
	4:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14], #1-10 + 14
	5:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 15, 16], #1-10 + 14,15.16
	6:[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]} #1-10 + 11

right_answers = [1,1,1,1,0,0,0,0,0,0,1,1,1,1,1,1]

images = {
	1:'images/1.jpg',
	3:'images/3.jpg',
	4:'images/4.jpg',
	12:'images/1.jpg',
}

if __name__ == "__main__":
	print(len(right_answers))